# IControllableDropHandler Methods

---
The IControllableDropHandler type exposes the following members.
| Name| Description
---|---|---
| CanExecute|  Implement this method to inform Revit whether the drop event can be executed onto the given view.
| Execute|  Implement this method to handle the drop event for your data. (Inherited from IDropHandler)
Top
#### Reference
IControllableDropHandler Interface
Autodesk.Revit.UI Namespace